// Сценарий 1: Профил на потребител в приложение
// Представи си, че правиш малка част от кода за профилната страница на потребител.

// Име и Фамилия: Те обикновено не се променят често в рамките на една сесия.

// Брой последователи: Тази стойност ще се увеличава, ако някой натисне "Follow".

// Дата на раждане: Това е константа за целия живот на потребителя.

// Твоята задача: Опитай се да дефинираш тези променливи в конзолата, като използваш правилната ключова дума (let или const).

let firstName = "Some First Name";
let lastName = "Some Last Name";
let numberFollowers = 0;
const birthDate = 1990;

// Сценарий 2: Количка за пазаруване
// Логиката на един онлайн магазин разчита изцяло на управление на данни.

// Цена на продукта: Трябва ли да се променя веднъж дефинирана за конкретния артикул?

// Обща сума на количката: Какво се случва с нея, когато добавяме нови продукти?

// Промо код: Ако потребителят реши да го смени с по-добър?

let productPrice = 1.56;
let cartPrice = 1.56;
let promoCode = "abcd";

// Сценарий 3: Светофар (Логика на софтуер)
// Ако програмираш логиката на един светофар:

// Цветовете (Червено, Жълто, Зелено): Самите имена на цветовете променят ли се някога?

// Текущ цвят: Стойността, която показва кой цвят свети в момента (например "Red"). Тя променя ли се?

const redColor = "red";
const yellowColor = "yellow";
const greenColor = "green";

let currentColor = 'yellow';

// Практическо упражнение за теб
// Опитай се да напишеш малък блок код, който решава следната ситуация:

// Създай променлива за името на държавата, в която живееш. След това създай променлива за населението й. Накрая създай променлива, която казва дали държавата е на остров (вярно/грешно).

// Бонус: Промени населението с +1 (защото се е родило бебе) и виж дали ще получиш грешка, ако си използвала const.

const myCountry = 'Bulgaria';
let population = 6.7;
const isIsland = false;

let newBaby = 0.000001;

population += newBaby;

console.log("My country is: " + myCountry);
console.log(`The population of the ${myCountry} is ${population}`);
console.log("Is the Country " + myCountry + " Island? " + isIsland);
console.log("The population number after new baby born: " + population);